[{"title":"Thinking Helix","uri":"ahf-thinking-helix","taxon":"Post","tags":["blog"],"route":"/forest/ahf-thinking-helix/","metas":{}},{"title":"Abstract Consistency Properties for Hybrid Logic: Smullyan’s Unifying Principle in Isabelle/HOL","uri":"ahfrom-2025-talk-tb","taxon":"Reference","tags":["talk","highlight"],"route":"/forest/ahfrom-2025-talk-tb/","metas":{"venue":"Logic: from Arthur Prior to Computation and Cognition — Workshop in Honour of Professor Torben Braüner, Roskilde University","slides":"https://astahfrom.github.io/forest/bafkrmifpien6mpvy4eouximtq6qg5qemag5h64tgd3iorbw3hdwvffl3qa.pdf"}},{"title":"Metrics","uri":"ahf-metrics","taxon":null,"tags":[],"route":"/forest/ahf-metrics/","metas":{}},{"title":"BSc","uri":"ahf-bsc","taxon":null,"tags":[],"route":"/forest/ahf-bsc/","metas":{}},{"title":"MSc","uri":"ahf-msc","taxon":null,"tags":[],"route":"/forest/ahf-msc/","metas":{}},{"title":"Awards, Grants & Competitions","uri":"ahf-awards","taxon":null,"tags":[],"route":"/forest/ahf-awards/","metas":{}},{"title":"Curriculum Vitae","uri":"ahf-cv","taxon":null,"tags":[],"route":"/forest/ahf-cv/","metas":{}},{"title":"Software Development for Digital Health","uri":"ahf-sddh","taxon":null,"tags":[],"route":"/forest/ahf-sddh/","metas":{}},{"title":"Supervision","uri":"ahf-supervision","taxon":null,"tags":[],"route":"/forest/ahf-supervision/","metas":{}},{"title":"Teaching","uri":"ahf-teaching","taxon":null,"tags":[],"route":"/forest/ahf-teaching/","metas":{}},{"title":"Teaching Assistant","uri":"ahf-ta","taxon":null,"tags":[],"route":"/forest/ahf-ta/","metas":{}},{"title":"Program Committees","uri":"ahf-pc","taxon":null,"tags":[],"route":"/forest/ahf-pc/","metas":{}},{"title":"Research Visits","uri":"ahf-visits","taxon":null,"tags":[],"route":"/forest/ahf-visits/","metas":{}},{"title":"Reviewing","uri":"ahf-reviewing","taxon":null,"tags":[],"route":"/forest/ahf-reviewing/","metas":{}},{"title":"Subreviewing","uri":"ahf-subreviewing","taxon":null,"tags":[],"route":"/forest/ahf-subreviewing/","metas":{}},{"title":"Academic Activities","uri":"ahf-academia","taxon":null,"tags":[],"route":"/forest/ahf-academia/","metas":{}},{"title":"PhD","uri":"ahf-phd","taxon":null,"tags":[],"route":"/forest/ahf-phd/","metas":{}},{"title":"Postdoc","uri":"ahf-sdps","taxon":null,"tags":[],"route":"/forest/ahf-sdps/","metas":{}},{"title":"Dalux","uri":"ahf-dalux","taxon":null,"tags":[],"route":"/forest/ahf-dalux/","metas":{}},{"title":"Prior’s ideal language","uri":"blackburn-brauner-kofod-2025","taxon":"Reference","tags":["journal"],"route":"/forest/blackburn-brauner-kofod-2025/","metas":{"doi":"10.1017/S0960129525000076","venue":"Mathematical Structures in Computer Science, volume 35, e7","bibtex":"@article{Blackburn_Braüner_Kofod_2025,\n  title={Prior’s ideal language},\n  volume={35},\n  DOI={10.1017/S0960129525000076},\n  journal={Mathematical Structures in Computer Science},\n  author={Blackburn, Patrick and Braüner, Torben and Kofod, Julie Lundbak},\n  year={2025},\n  pages={e7}}"}},{"title":"How to Speak Logic with your Computer: The Unreasonable Effectiveness of a Machine Assistant","uri":"ahfrom-2025-talk-bits","taxon":"Reference","tags":["talk"],"route":"/forest/ahfrom-2025-talk-bits/","metas":{"venue":"DIKU Bits","slides":"https://astahfrom.github.io/forest/bafkrmih2onpoea7xf6nbpjoeusnnhuwnyus4bdfc6zjy6tnbv6dc2435ye.pdf","external":"https://di.ku.dk/forsidebegivenheder/begivenheder-2024/diku-bits-by-asta-halkjaer-from/"}},{"title":"An Isabelle/HOL Framework for Synthetic Completeness Proofs","uri":"ahfrom-2025-cpp","taxon":"Reference","tags":["proceedings","highlight"],"route":"/forest/ahfrom-2025-cpp/","metas":{"doi":"10.1145/3703595.3705882","venue":"In K. Stark et al (ed.) Proceedings of the 14th ACM SIGPLAN International Conference on Certified Programs and Proofs (CPP 2025)","slides":"https://astahfrom.github.io/forest/bafkrmig7aq7xnj4hn3sqzld7unlsy5kttfe7gpaw6drrn3ro64o3nrhluq.pdf","bibtex":"@inproceedings{DBLP:conf/cpp/From25,\nabstract = {Proof assistants like Isabelle/HOL provide the perfect opportunity to develop more than just one-off formalizations, but frameworks for developing new results within a given area. Completeness results for logical calculi often include bespoke versions of Lindenbaum's lemma. In this paper, I mechanize an abstract, transfinite version of the lemma and use it to build witnessed, maximal consistent sets (MCSs) for any notion of consistency that satisfies a few requirements. I prove abstract results about when MCSs reflect the proof rules of the underlying calculi. Finally, I formalize a process for mechanically calculating saturated set conditions from a given logic's semantics. This separates the truth lemma that connects MCS-membership and satisfiability into semantic and syntactic components, giving concrete proof obligations for each operator of the logic. To illustrate the framework's applicability, I instantiate it with propositional, first-order, modal and hybrid logic examples. I mechanize strong completeness for each logic, even for uncountably large languages, proving that, if a formula is valid under a set of assumptions, then we can derive it from a finite subset.},\nauthor = {Asta Halkj{æ}r From},\nbooktitle = {Proceedings of the 14th {ACM} {SIGPLAN} International Conference on Certified Programs and Proofs, {CPP} 2025, Denver, CO, USA, January 20-21, 2025},\ndoi = {10.1145/3703595.3705882},\neditor = {Kathrin Stark and Amin Timany and Sandrine Blazy and Nicolas Tabareau},\npages = {171--186},\npublisher = {{ACM}},\ntitle = {An Isabelle/HOL Framework for Synthetic Completeness Proofs},\nyear = {2025},\n}"}},{"title":"Dalux","uri":"dalux","taxon":"Company","tags":[],"route":"/forest/dalux/","metas":{"external":"https://www.dalux.com/"}},{"title":"Formalized Soundness and Completeness of Epistemic and Public Announcement Logic","uri":"ahfrom-2024-jlc-wollic","taxon":"Reference","tags":["journal","highlight"],"route":"/forest/ahfrom-2024-jlc-wollic/","metas":{"doi":"10.1093/logcom/exae054","venue":"Journal of Logic and Computation","bibtex":"@article{From24,\nabstract = {{I strengthen the foundations of epistemic logic by formalizing the family of normal modal logics in the proof assistant Isabelle/HOL. I define an abstract canonical model over any set of axioms and formalize completeness-via-canonicity: when the canonical model for the chosen axioms belongs to a certain class of frames, strong completeness over that class follows immediately. I instantiate the result with logics based on various epistemic principles to obtain completeness results for systems from K to S5. I then move to a family of public announcement logics (PAL) and prove abstract results for strong soundness and completeness. I lift the completeness results from epistemic logic to the setting with public announcements in a modular way. This work formulates the completeness-via-canonicity technique as a proper theorem and demonstrates its applicability. Additionally, it succinctly formalizes the requirements for lifting completeness from bare epistemic logic to the addition of public announcements.}},\nauthor = {From, Asta Halkjær},\ndoi = {10.1093/logcom/exae054},\nissn = {0955-792X},\njournal = {Journal of Logic and Computation},\nmonth = {09},\ntitle = {{Formalized Soundness and Completeness of Epistemic and Public Announcement Logic}},\nyear = {2024},\n}"}},{"title":"Verifying a Sequent Calculus Prover for First-Order Logic with Functions in Isabelle/HOL","uri":"ahfrom-fkjacobsen-2024-jar","taxon":"Reference","tags":["journal","highlight"],"route":"/forest/ahfrom-fkjacobsen-2024-jar/","metas":{"doi":"10.1007/s10817-024-09697-3","venue":"Journal of Automated Reasoning 68(15)","bibtex":"@article{FromJ24,\nabstract = {We describe the design, implementation and verification of an automated theorem prover for first-order logic with functions. The proof search procedure is based on sequent calculus and we formally verify its soundness and completeness in Isabelle/HOL using an existing abstract framework for coinductive proof trees. Our analytic completeness proof covers both open and closed formulas. Since our deterministic prover considers only the subset of terms relevant to proving a given sequent, we do so as well when building a countermodel from a failed proof. Finally, we formally connect our prover with the proof system and semantics of the existing SeCaV system. In particular, the prover can generate human-readable SeCaV proofs which are also machine-verifiable proof certificates.},\nauthor = {Asta Halkj{æ}r From and Frederik Krogsdal Jacobsen},\ndoi = {10.1007/s10817-024-09697-3},\njournal = {Journal of Automated Reasoning},\nnumber = {15},\npublisher = {Springer},\ntitle = {Verifying a Sequent Calculus Prover for First-Order Logic with Functions in {Isabelle/HOL}},\nvolume = {68},\nyear = {2024},\n}"}},{"title":"A Cute Trick for Calculating Saturated Sets","uri":"ahfrom-2023-talk-clg","taxon":"Reference","tags":["talk","highlight"],"route":"/forest/ahfrom-2023-talk-clg/","metas":{"venue":"Copenhagen Logic Gathering","slides":"https://astahfrom.github.io/forest/bafkrmigo6jbqscqdbxyvnap7lbnh5dntbow4fltfber62mtd5fvodtrhj4.pdf"}},{"title":"Formally Correct Deduction Methods for Computational Logic","uri":"ahfrom-2023-phd-thesis","taxon":"Reference","tags":["thesis","highlight"],"route":"/forest/ahfrom-2023-phd-thesis/","metas":{"venue":"PhD thesis, Technical University of Denmark","slides":"https://astahfrom.github.io/forest/bafkrmihlakseuvtsrtlywgufu6u7td4va5ezlfnlvwapqbfekcjubtxee4.pdf","external":"https://astahfrom.github.io/forest/bafkrmia3dddrsbaogkrwfwjc3i4f3vdjhq6rlnoziegwyk5veymmgzlnfa.pdf"}},{"title":"A Naive Prover for First-Order Logic: A Minimal Example of Analytic Completeness","uri":"ahfrom-jvilladsen-2023-tableaux","taxon":"Reference","tags":["proceedings"],"route":"/forest/ahfrom-jvilladsen-2023-tableaux/","metas":{"doi":"10.1007/978-3-031-43513-3_25","venue":"In R. Ramanayake and J. Urban (ed.) Automated Reasoning with Analytic Tableaux and Related Methods - 32nd International Conference (TABLEAUX 2023)","bibtex":"@inproceedings{FromV23,\nabstract = {The analytic technique for proving completeness gives a very operational perspective: build a countermodel to the unproved formula from a failed proof attempt in your calculus. We have to be careful, however, that the proof attempt did not fail because our strategy in finding it was flawed. Overcoming this concern requires designing a prover. We design and formalize in Isabelle/HOL a sequent calculus prover for first-order logic with functions. We formalize soundness and completeness theorems using an existing framework and extract executable code to Haskell. The crucial idea is to move complexity from the prover itself to a stream of instructions that it follows. The result serves as a minimal example of the analytic technique, a naive prover for first-order logic, and a case study in formal verification.},\nauthor = {Asta Halkj{æ}r From and J{ø}rgen Villadsen},\nbooktitle = {Automated Reasoning with Analytic Tableaux and Related Methods - 32nd International Conference, {TABLEAUX} 2023, Prague, Czech Republic, September 18-21, 2023, Proceedings},\ndoi = {10.1007/978-3-031-43513-3_25},\neditor = {Revantha Ramanayake and Josef Urban},\npages = {468--480},\npublisher = {Springer},\nseries = {Lecture Notes in Computer Science},\ntitle = {A Naive Prover for First-Order Logic: {A} Minimal Example of Analytic Completeness},\nvolume = {14278},\nyear = {2023},\n}"}},{"title":"A Sequent Calculus for First-order Logic Formalized in Isabelle/HOL","uri":"ahfrom-aschlichtkrull-jvilladsen-2023-jlc","taxon":"Reference","tags":["journal"],"route":"/forest/ahfrom-aschlichtkrull-jvilladsen-2023-jlc/","metas":{"doi":"10.1093/logcom/exad013","venue":"Journal of Logic and Computation 33(4)","bibtex":"@article{FromSV23,\nabstract = {We formalize in Isabelle/HOL soundness and completeness of a one-sided sequent calculus for first-order logic. The completeness is shown via a translation from a semantic tableau calculus, whose completeness proof we base on the theory entry ‘First-Order Logic According to Fitting’ by Berghofer in the Archive of Formal Proofs. The calculi and proof techniques are taken from Ben-Ari’s textbook Mathematical Logic for Computer Science (Springer, 2012). We thereby demonstrate that Berghofer’s approach works not only for natural deduction but also constitutes a framework for mechanically checked completeness proofs for a range of proof systems.},\nauthor = {Asta Halkj{æ}r From and Anders Schlichtkrull and J{ø}rgen Villadsen},\ndoi = {10.1093/logcom/exad013},\njournal = {Journal of Logic and Computation},\nnumber = {4},\npages = {818--836},\ntitle = {A Sequent Calculus for First-order Logic Formalized in {Isabelle/HOL}},\nvolume = {33},\nyear = {2023},\n}"}},{"title":"Aesop: White-Box Best-First Proof Search for Lean","uri":"jlimperg-ahfrom-2023-cpp","taxon":"Reference","tags":["proceedings","highlight","distinguished"],"route":"/forest/jlimperg-ahfrom-2023-cpp/","metas":{"doi":"10.1145/3573105.3575671","venue":"In R. Krebbers et al (ed.) Proceedings of the 12th ACM SIGPLAN International Conference on Certified Programs and Proofs (CPP 2023)","bibtex":"@inproceedings{LimpergF23,\nabstract = {We present Aesop, a proof search tactic for the Lean 4 interactive theorem prover. Aesop performs a tree-based search over a user-specified set of proof rules. It supports safe and unsafe rules and uses a best-first search strategy with customisable prioritisation. Aesop also allows users to register custom normalisation rules and integrates Lean's simplifier to support equational reasoning. Many details of Aesop's search procedure are designed to make it a white-box proof automation tactic, meaning that users should be able to easily predict how their rules will be applied, and thus how powerful and fast their Aesop invocations will be. Since we use a best-first search strategy, it is not obvious how to handle metavariables which appear in multiple goals. The most common strategy for dealing with metavariables relies on backtracking and is therefore not suitable for best-first search. We give an algorithm which addresses this issue. The algorithm works with any search strategy, is independent of the underlying logic and makes few assumptions about how rules interact with metavariables. We conjecture that with a fair search strategy, the algorithm is as complete as the given set of rules allows.},\nauthor = {Jannis Limperg and Asta Halkj{æ}r From},\nbooktitle = {Proceedings of the 12th {ACM} {SIGPLAN} International Conference on Certified Programs and Proofs, {CPP} 2023, Boston, MA, USA, January 16-17, 2023},\ndoi = {10.1145/3573105.3575671},\neditor = {Robbert Krebbers and Dmitriy Traytel and Brigitte Pientka and Steve Zdancewic},\npages = {253--266},\npublisher = {{ACM}},\ntitle = {Aesop: White-Box Best-First Proof Search for Lean},\nyear = {2023},\n}"}},{"title":"More Formalized Axiomatic Systems for Propositional Logic in Isabelle/HOL","uri":"ameschen-ahfrom-jvilladsen-2023-slai","taxon":"Reference","tags":["proceedings"],"route":"/forest/ameschen-ahfrom-jvilladsen-2023-slai/","metas":{"external":"https://slai2022.islai.org/proceedings/","venue":"In S. Cojocaru et al (ed.) Logic and Artificial Intelligence","bibtex":"@inbook{EschenFV23,\nabstract = {We consider a plethora of well-known axiomatic systems, and some less well-known variants, for classical propositional logic all with soundness and completeness theorems formalized in the proof assistant Isabelle/HOL. We have previously only formalized systems based on either implication and falsity or on disjunction and negation. We have now formalized 12 additional systems based on implication and negation. Each of them has three or more axioms. We have also formalized single-axiom systems, by Lukasiewicz and Tarski as well as by Meredith, and we describe the formalization of the former in detail. A few systems with two axioms are described too.},\naddress = {Chisinau},\nauthor = {Agnes Moesg{å}rd Eschen and Asta Halkj{æ}r From and J{ø}rgen Villadsen},\nbooktitle = {Logic and Artificial Intelligence},\neditor = {Svetlana Cojocaru and Ioachim Drugus and Mykola Nikitchenco and Alexei Muravitsky},\nisbn = {978-9975-68-484-2},\npages = {7--22},\npublisher = {Vladimir Andrunachievici Institute of Mathematics and Computer Science},\ntitle = {More Formalized Axiomatic Systems for Propositional Logic in {Isabelle/HOL}},\nurl = {https://slai2022.islai.org/proceedings/},\nyear = {2023},\n}"}},{"title":"Synthetic Completeness","uri":"ahfrom-2023-afp-synthetic-completeness","taxon":"Reference","tags":["isabelle"],"route":"/forest/ahfrom-2023-afp-synthetic-completeness/","metas":{"external":"https://isa-afp.org/entries/Synthetic_Completeness.html","venue":"Archive of Formal Proofs","bibtex":"@article{Synthetic_Completeness-AFP,\nabstract = {In this work, I provide an abstract framework for proving the completeness of a logical calculus using the synthetic method. The synthetic method is based on maximal consistent saturated sets (MCSs). A set of formulas is consistent (with respect to the calculus) when we cannot derive a contradiction from it. It is maximally consistent when it contains every formula that is consistent with it. For logics where it is relevant, it is saturated when it contains a witness for every existential formula. To prove completeness using these maximal consistent saturated sets, we prove a truth lemma: every formula in an MCS has a satisfying model. Here, Hintikka sets provide a useful stepping stone. These can be seen as characterizations of the MCSs based on simple subformula conditions rather than via the calculus. We then prove that every Hintikka set gives rise to a satisfying model and that MCSs are Hintikka sets. Now, assume a valid formula cannot be derived. Then its negation must be consistent and therefore satisfiable. This contradicts validity and the original formula must be derivable. To start, I build maximal consistent saturated sets for any logic that satisfies a small set of assumptions. I do this using a transfinite version of Lindenbaum's lemma, which allows me to support languages of any cardinality. I then prove useful abstract results about derivations and refutations as they relate to MCSs. Finally, I show how Hintikka sets can be derived from the logic's semantics, outlining one way to prove the required truth lemma. To demonstrate the versatility of the framework, I instantiate it with five different examples. The formalization contains soundness and completeness results for: a propositional tableau calculus, a propositional sequent calculus, an axiomatic system for modal logic, a labelled natural deduction system for hybrid logic and a natural deduction system for first-order logic. The tableau example uses custom Hintikka sets based on the calculus, but the other four examples derive them from the semantics in the style of the framework. The hybrid and first-order logic examples rely on saturated MCSs. This places requirements on the cardinalities of their languages to ensure that there are enough witnesses available. In both cases, the type of witnesses must be infinite and have cardinality at least that of the type of propositional/predicate symbols.},\nauthor = {Asta Halkjær From},\nissn = {2150-914x},\njournal = {Archive of Formal Proofs},\nmonth = {January},\ntitle = {Synthetic Completeness},\nurl = {https://isa-afp.org/entries/Synthetic_Completeness.html},\nyear = {2023},\n}"}},{"title":"Generic Epistemic and Public Announcement Logic Completeness Results","uri":"ahfrom-2022-talk-pal","taxon":"Reference","tags":["talk"],"route":"/forest/ahfrom-2022-talk-pal/","metas":{"venue":"Logic & AI @ AlgoLoG seminar, DTU Compute","slides":"https://astahfrom.github.io/forest/bafkrmiati2ris22dy24q6aix3smywxzd22xklozrgi55fngo7mnv3n2dz4.pdf"}},{"title":"A Naive Prover for First-Order Logic","uri":"ahfrom-2022-talk-lsd","taxon":"Reference","tags":["talk","invited"],"route":"/forest/ahfrom-2022-talk-lsd/","metas":{"venue":"The Languages, Systems, and Data Seminar (LSD spring 2022)","slides":"https://astahfrom.github.io/forest/bafkrmigayu2vn7j5jdnawtzu5e6tlksd6vjlamv2fvuv5mjvhbanhpndxa.pdf"}},{"title":"A Case Study in Computer-Assisted Meta-reasoning","uri":"ahfrom-stlund-jvilladsen-2022-dcai","taxon":"Reference","tags":["proceedings"],"route":"/forest/ahfrom-stlund-jvilladsen-2022-dcai/","metas":{"doi":"10.1007/978-3-030-86887-1_5","venue":"In S. R. González et al (ed.) Distributed Computing and Artificial Intelligence, Volume 2: Special Sessions 18th International Conference","bibtex":"@inproceedings{FromLV22,\nabstract = {We discuss human and mechanized reasoning with regards to the use of proof assistants, in particular Isabelle/HOL. We use the development of novel NAND- and NOR-based micro provers as a case study. Current, widely available automated reasoning technology is suitable for assisting humans with certain types of reasoning, like finding proofs for well-defined theorems. Other types of reasoning, like the discovery of new theorems, are notoriously difficult for mechanized reasoning. Our case study indicates that proof assistants are well suited as development tools for assuredly correct programs in languages like Haskell.},\naddress = {Cham},\nauthor = {From, Asta Halkj{æ}r and Lund, Simon Tobias and Villadsen, J{ø}rgen},\nbooktitle = {Distributed Computing and Artificial Intelligence, Volume 2: Special Sessions 18th International Conference},\ndoi = {10.1007/978-3-030-86887-1_5},\neditor = {Gonz{á}lez, Sara Rodr{í}guez and Machado, Jos{é} Manuel and Gonz{á}lez-Briones, Alfonso and Wikarek, Jaroslaw and Loukanova, Roussanka and Katranas, George and Casado-Vara, Roberto},\nisbn = {978-3-030-86887-1},\npages = {53--63},\npublisher = {Springer International Publishing},\nseries = {Lecture Notes in Networks and Systems},\ntitle = {A Case Study in Computer-Assisted Meta-reasoning},\nvolume = {332},\nyear = {2022},\n}"}},{"title":"A Naive Prover for First-Order Logic","uri":"ahfrom-2022-afp-naive","taxon":"Reference","tags":["isabelle"],"route":"/forest/ahfrom-2022-afp-naive/","metas":{"external":"https://isa-afp.org/entries/FOL_Seq_Calc3.html","venue":"Archive of Formal Proofs","bibtex":"@article{FOL_Seq_Calc3-AFP,\nabstract = { The AFP entry Abstract Completeness by Blanchette, Popescu and Traytel formalizes the core of Beth/Hintikka-style completeness proofs for first-order logic and can be used to formalize executable sequent calculus provers. In the Journal of Automated Reasoning, the authors instantiate the framework with a sequent calculus for first-order logic and prove its completeness. Their use of an infinite set of proof rules indexed by formulas yields very direct arguments. A fair stream of these rules controls the prover, making its definition remarkably simple. The AFP entry, however, only contains a toy example for propositional logic. The AFP entry A Sequent Calculus Prover for First-Order Logic with Functions by From and Jacobsen also uses the framework, but uses a finite set of generic rules resulting in a more sophisticated prover with more complicated proofs. This entry contains an executable sequent calculus prover for first-order logic with functions in the style presented by Blanchette et al. The prover can be exported to Haskell and this entry includes formalized proofs of its soundness and completeness. The proofs are simpler than those for the prover by From and Jacobsen but the performance of the prover is significantly worse. The included theory Fair-Stream first proves that the sequence of natural numbers 0, 0, 1, 0, 1, 2, etc. is fair. It then proves that mapping any surjective function across the sequence preserves fairness. This method of obtaining a fair stream of rules is similar to the one given by Blanchette et al. The concrete functions from natural numbers to terms, formulas and rules are defined using the Nat-Bijection theory in the HOL-Library. },\nauthor = {Asta Halkjær From},\nissn = {2150-914x},\njournal = {Archive of Formal Proofs},\nmonth = {March},\ntitle = {A Naive Prover for First-Order Logic},\nurl = {https://isa-afp.org/entries/FOL_Seq_Calc3.html},\nyear = {2022},\n}"}},{"title":"A Sequent Calculus Prover for First-Order Logic with Functions","uri":"ahfrom-fkjacobsen-2022-afp-prover","taxon":"Reference","tags":["isabelle"],"route":"/forest/ahfrom-fkjacobsen-2022-afp-prover/","metas":{"external":"https://isa-afp.org/entries/FOL_Seq_Calc2.html","venue":"Archive of Formal Proofs","bibtex":"@article{FOL_Seq_Calc2-AFP,\nabstract = {We formalize an automated theorem prover for first-order logic with functions. The proof search procedure is based on sequent calculus and we verify its soundness and completeness using the Abstract Soundness and Abstract Completeness theories. Our analytic completeness proof covers both open and closed formulas. Since our deterministic prover considers only the subset of terms relevant to proving a given sequent, we do so as well when building a countermodel from a failed proof. We formally connect our prover with the proof system and semantics of the existing SeCaV system. In particular, the prover's output can be post-processed in Haskell to generate human-readable SeCaV proofs which are also machine-verifiable proof certificates. Paper: doi.org/10.4230/LIPIcs.ITP.2022.13.},\nauthor = {Asta Halkjær From and Frederik Krogsdal Jacobsen},\nissn = {2150-914x},\njournal = {Archive of Formal Proofs},\nmonth = {January},\ntitle = {A Sequent Calculus Prover for First-Order Logic with Functions},\nurl = {https://isa-afp.org/entries/FOL_Seq_Calc2.html},\nyear = {2022},\n}"}},{"title":"Interactive Theorem Proving for Logic and Information","uri":"jvilladsen-ahfrom-abjensen-aschlichtkrull-2022-nplinai","taxon":"Reference","tags":["book"],"route":"/forest/jvilladsen-ahfrom-abjensen-aschlichtkrull-2022-nplinai/","metas":{"doi":"10.1007/978-3-030-90138-7_2","venue":"In R. Loukanova (ed.) Natural Language Processing in Artificial Intelligence (NLPinAI 2021)","bibtex":"@inbook{VilladsenFJS22,\nabstract = {Automated reasoning is the study of computer programs that can build proofs of theorems in a logic. Such programs can be either automatic theorem provers or interactive theorem provers. The latter are also called proof assistants because the user constructs the proofs with the help of the system. We focus on the Isabelle proof assistant. The system ensures that the proofs are correct, in contrast to pen-and-paper proofs which must be checked manually. We present applications to logical systems and models of information, in particular selected modal logics extending classical propositional logic. Epistemic logic allows intelligent systems to reason about the knowledge of agents. Public announcements can change the knowledge of the system and its agents. In order to account for this, epistemic logic can be extended to public announcement logic. An axiomatic system consists of axioms and rules of inference for deriving statements in a logic. Sound systems can only derive valid statements and complete systems can derive all valid statements. We describe formalizations of sound and complete axiomatic systems for epistemic logic and public announcement logic, thereby strengthening the foundations of automated reasoning for logic and information.},\naddress = {Cham},\nauthor = {Villadsen, J{ø}rgen and From, Asta Halkj{æ}r and Jensen, Alexander Birch and Schlichtkrull, Anders},\nbooktitle = {Natural Language Processing in Artificial Intelligence --- NLPinAI 2021},\ndoi = {10.1007/978-3-030-90138-7_2},\neditor = {Loukanova, Roussanka},\nisbn = {978-3-030-90138-7},\npages = {25--48},\npublisher = {Springer International Publishing},\nseries = {Studies in Computational Intelligence},\ntitle = {Interactive Theorem Proving for Logic and Information},\nvolume = {999},\nyear = {2022},\n}"}},{"title":"On Termination for Hybrid Tableaux","uri":"ahfrom-2022-isabelle-workshop","taxon":"Reference","tags":["workshop"],"route":"/forest/ahfrom-2022-isabelle-workshop/","metas":{"external":"https://files.sketis.net/Isabelle_Workshop_2022/Isabelle_2022_paper_13.pdf","venue":"Isabelle Workshop 2022","slides":"https://astahfrom.github.io/forest/bafkrmie5exb5zp6b5cusawk7dujn2fqebunl7gytlxp6d4zcwfvq6dgtoq.pdf","bibtex":"@unpublished{From22,\nabstract = {I sketch preliminary work on formalizing the termination of a tableau calculus for basic hybrid logic, whose soundness and completeness have already been formally verified. The formalization includes some crucial theorems, but omits others.},\nauthor = {Asta Halkjær From},\nnote = {Isabelle Workshop 2022},\ntitle = {On Termination for Hybrid Tableaux},\nurl = {https://files.sketis.net/Isabelle_Workshop_2022/Isabelle_2022_paper_13.pdf},\nyear = {2022},\n}"}},{"title":"Soundness and Completeness of Implicational Logic","uri":"ahfrom-jvilladsen-2022-afp-implicational","taxon":"Reference","tags":["isabelle"],"route":"/forest/ahfrom-jvilladsen-2022-afp-implicational/","metas":{"external":"https://isa-afp.org/entries/Implicational_Logic.html","venue":"Archive of Formal Proofs","bibtex":"@article{Implicational_Logic-AFP,\nabstract = {This work is a formalization of soundness and completeness of the Bernays-Tarski axiom system for classical implicational logic. The completeness proof is constructive following the approach by László Kalmár, Elliott Mendelson and others. The result can be extended to full classical propositional logic by uncommenting a few lines for falsehood.},\nauthor = {Asta Halkjær From and Jørgen Villadsen},\nissn = {2150-914x},\njournal = {Archive of Formal Proofs},\nmonth = {September},\ntitle = {Soundness and Completeness of Implicational Logic},\nurl = {https://isa-afp.org/entries/Implicational_Logic.html},\nyear = {2022},\n}"}},{"title":"Verifying a Sequent Calculus Prover for First-Order Logic with Functions in Isabelle/HOL","uri":"ahfrom-fkjacobsen-2022-itp","taxon":"Reference","tags":["proceedings"],"route":"/forest/ahfrom-fkjacobsen-2022-itp/","metas":{"doi":"10.4230/LIPIcs.ITP.2022.13","venue":"In J. Andronick and L. de Moura (ed.) 13th International Conference on Interactive Theorem Proving (ITP 2022)","slides":"https://astahfrom.github.io/forest/bafkrmidpylm6xwm7o3xcnantekrgxxnqdt45cut2zhvw7sx6vxr5ok2zq4.pdf","bibtex":"@inproceedings{FromJ22,\nabstract = {We describe the design, implementation and verification of an automated theorem prover for first-order logic with functions. The proof search procedure is based on sequent calculus and we formally verify its soundness and completeness in Isabelle/HOL using an existing abstract framework for coinductive proof trees. Our analytic completeness proof covers both open and closed formulas. Since our deterministic prover considers only the subset of terms relevant to proving a given sequent, we do so as well when building a countermodel from a failed proof. Finally, we formally connect our prover with the proof system and semantics of the existing SeCaV system. In particular, the prover can generate human-readable SeCaV proofs which are also machine-verifiable proof certificates.},\nauthor = {Asta Halkj{æ}r From and Frederik Krogsdal Jacobsen},\nbooktitle = {13th International Conference on Interactive Theorem Proving, {ITP} 2022, August 7-10, 2022, Haifa, Israel},\ndoi = {10.4230/LIPIcs.ITP.2022.13},\neditor = {June Andronick and Leonardo de Moura},\npages = {13:1--13:22},\npublisher = {Schloss Dagstuhl - Leibniz-Zentrum f{ü}r Informatik},\nseries = {LIPIcs},\ntitle = {Verifying a Sequent Calculus Prover for First-Order Logic with Functions in {Isabelle/HOL}},\nvolume = {237},\nyear = {2022},\n}"}},{"title":"My PhD Journey","uri":"ahfrom-2021-talk-kickoff","taxon":"Reference","tags":["talk","invited"],"route":"/forest/ahfrom-2021-talk-kickoff/","metas":{"venue":"Kick-off event for new PhD students at DTU Compute"}},{"title":"Hybrid Logic","uri":"ahfrom-2021-talk-wld","taxon":"Reference","tags":["talk"],"route":"/forest/ahfrom-2021-talk-wld/","metas":{"venue":"3rd World Logic Day 2021, A Zoom on Logic, DTU Compute","slides":"https://astahfrom.github.io/forest/bafkrmig2ivpizcq3mwoc3dffs5i6s73pumbt2n4huc4t52ubizi54pjbvu.pdf"}},{"title":"A Sequent Calculus for First-Order Logic Formalized in Isabelle/HOL","uri":"ahfrom-aschlichtkrull-jvilladsen-2021-cilc","taxon":"Reference","tags":["proceedings"],"route":"/forest/ahfrom-aschlichtkrull-jvilladsen-2021-cilc/","metas":{"external":"http://ceur-ws.org/Vol-3002/paper7.pdf","venue":"In S. Monica and F. Bergenti (ed.) Proceedings of the 36th Italian Conference on Computational Logic (CILC 2021)","bibtex":"@inproceedings{FromSV21,\nabstract = {We formalize in Isabelle/HOL soundness and completeness of a one-sided sequent calculus for first-order logic. The completeness is shown via a translation from a semantic tableau calculus, whose completeness proof we base on the theory entry “First-Order Logic According to Fitting” by Berghofer in the Archive of Formal Proofs (AFP). The calculi and proof techniques are taken from Ben-Ari’s textbook Mathematical Logic for Computer Science (Springer 2012). We thereby demonstrate that Berghofer’s approach works not only for natural deduction but constitutes a framework for mechanically-checked completeness proofs for a range of proof systems.},\nauthor = {Asta Halkj{æ}r From and Anders Schlichtkrull and J{ø}rgen Villadsen},\nbooktitle = {Proceedings of the 36th Italian Conference on Computational Logic, Parma, Italy, September 7-9, 2021},\neditor = {Stefania Monica and Federico Bergenti},\npages = {107--121},\npublisher = {CEUR-WS.org},\nseries = {{CEUR} Workshop Proceedings},\ntitle = {A Sequent Calculus for First-Order Logic Formalized in {Isabelle/HOL}},\nurl = {http://ceur-ws.org/Vol-3002/paper7.pdf},\nvolume = {3002},\nyear = {2021},\n}"}},{"title":"A Succinct Formalization of the Completeness of First-Order Logic","uri":"ahfrom-2021-types","taxon":"Reference","tags":["proceedings"],"route":"/forest/ahfrom-2021-types/","metas":{"doi":"10.4230/LIPIcs.TYPES.2021.8","venue":"In H. Basold, J. Cockx and S. Ghilezan (ed.) 27th International Conference on Types for Proofs and Programs (TYPES 2021)","bibtex":"@inproceedings{From21-TYPES,\nabstract = {I succinctly formalize the soundness and completeness of a small Hilbert system for first-order logic in the proof assistant Isabelle/HOL. The proof combines and details ideas from de Bruijn, Henkin, Herbrand, Hilbert, Hintikka, Lindenbaum, Smullyan and others in a novel way, and I use a declarative style, custom notation and proof automation to obtain a readable formalization. The formalized definitions of Hintikka sets and Herbrand structures allow open and closed formulas to be treated uniformly, making free variables a non-concern. This paper collects important techniques in mathematical logic in a way suited for both study and further work.},\nauthor = {Asta Halkj{æ}r From},\nbooktitle = {27th International Conference on Types for Proofs and Programs, {TYPES} 2021, June 14-18, 2021, Leiden, The Netherlands (Virtual Conference)},\ndoi = {10.4230/LIPIcs.TYPES.2021.8},\neditor = {Henning Basold and Jesper Cockx and Silvia Ghilezan},\npages = {8:1--8:24},\npublisher = {Schloss Dagstuhl - Leibniz-Zentrum f{ü}r Informatik},\nseries = {LIPIcs},\ntitle = {A Succinct Formalization of the Completeness of First-Order Logic},\nvolume = {239},\nyear = {2021},\n}"}},{"title":"Formalized Soundness and Completeness of Epistemic Logic","uri":"ahfrom-abjensen-jvilladsen-2021-lamassr","taxon":"Reference","tags":["abstract"],"route":"/forest/ahfrom-abjensen-jvilladsen-2021-lamassr/","metas":{"external":"https://lamassr.github.io/editions/2021/papers/Formalized-Soundness.pdf","venue":"International Workshop on Logical Aspects in Multi-Agent Systems and Strategic Reasoning (LAMAS & SR 2021)","slides":"https://astahfrom.github.io/forest/bafkrmifz4s3xphlgzo6ud5jyc7exmdeoqwmbtwuya2htzmo74l635mhghu.pdf","bibtex":"@unpublished{FromJV21a,\nabstract = {Epistemic logic allows reasoning about the knowledge of agents, and deductive proof systems enable this reasoning with a few axioms and inference rules. We strengthen the logical foundations of such a system by formalizing it in the proof assistant Isabelle/HOL. Our definitions are given in the precise language of higher-order logic and every step of our soundness and completeness proofs is mechanically checked.},\nauthor = {Asta Halkjær From and Alexander Birch Jensen and Jørgen Villadsen},\nnote = {International Workshop on Logical Aspects in Multi-Agent Systems and Strategic Reasoning (LAMAS & SR 2021), accepted abstract},\ntitle = {Formalized Soundness and Completeness of Epistemic Logic},\nurl = {https://lamassr.github.io/editions/2021/papers/Formalized-Soundness.pdf},\nyear = {2021},\n}"}},{"title":"Formalized Soundness and Completeness of Epistemic Logic","uri":"ahfrom-2021-wollic","taxon":"Reference","tags":["proceedings"],"route":"/forest/ahfrom-2021-wollic/","metas":{"doi":"10.1007/978-3-030-88853-4_1","venue":"In A. Silva, R. Wassermann and R. J. G. B. de Queiroz (ed.) Logic, Language, Information, and Computation - 27th International Workshop (WoLLIC 2021)","slides":"https://astahfrom.github.io/forest/bafkrmifqf67vymhhodxfjgkjanat6tdq7zk5mnibsvap3wwrs3rcqqeeh4.pdf","bibtex":"@inproceedings{From21-WoLLIC,\nabstract = {We strengthen the foundations of epistemic logic by formalizing the family of normal modal logics in the proof assistant Isabelle/HOL. We define an abstract canonical model and prove a truth lemma for any logic in the family. We then instantiate it with logics based on various epistemic principles to obtain completeness results for systems from K to S5. Our work gives a disciplined treatment of completeness-via-canonicity arguments and demonstrates their compositionality.},\nauthor = {Asta Halkj{æ}r From},\nbooktitle = {Logic, Language, Information, and Computation - 27th International Workshop, WoLLIC 2021, Virtual Event, October 5-8, 2021, Proceedings},\ndoi = {10.1007/978-3-030-88853-4_1},\neditor = {Alexandra Silva and Renata Wassermann and Ruy J. G. B. de Queiroz},\npages = {1--15},\npublisher = {Springer},\nseries = {Lecture Notes in Computer Science},\ntitle = {Formalized Soundness and Completeness of Epistemic Logic},\nvolume = {13038},\nyear = {2021},\n}"}},{"title":"Formalizing Axiomatic Systems for Propositional Logic in Isabelle/HOL","uri":"ahfrom-ameschen-jvilladsen-2021-cicm","taxon":"Reference","tags":["proceedings"],"route":"/forest/ahfrom-ameschen-jvilladsen-2021-cicm/","metas":{"doi":"10.1007/978-3-030-81097-9_3","venue":"In F. Kamareddine and C. S. Coen (ed.) Intelligent Computer Mathematics - 14th International Conference (CICM 2021)","slides":"https://astahfrom.github.io/forest/bafkrmihuicoogodnqur2r5iqzdhsni3s3iozdzjxcfz76ua33krmbcx7wq.pdf","bibtex":"@inproceedings{FromEV21,\nabstract = {We formalize soundness and completeness proofs for a number of axiomatic systems for propositional logic in the proof assistant Isabelle/HOL.},\nauthor = {Asta Halkj{æ}r From and Agnes Moesg{å}rd Eschen and J{ø}rgen Villadsen},\nbooktitle = {Intelligent Computer Mathematics - 14th International Conference, {CICM} 2021, Timisoara, Romania, July 26-31, 2021, Proceedings},\ndoi = {10.1007/978-3-030-81097-9_3},\neditor = {Fairouz Kamareddine and Claudio Sacerdoti Coen},\npages = {32--46},\npublisher = {Springer},\nseries = {Lecture Notes in Computer Science},\ntitle = {Formalizing Axiomatic Systems for Propositional Logic in {Isabelle/HOL}},\nvolume = {12833},\nyear = {2021},\n}"}},{"title":"Formalizing Henkin-Style Completeness of an Axiomatic System for Propositional Logic","uri":"ahfrom-2021-esslli","taxon":"Reference","tags":["proceedings"],"route":"/forest/ahfrom-2021-esslli/","metas":{"doi":"10.1007/978-3-031-50628-4_5","venue":"In A. Pavlova, M. Y. Pedersen and R. Bernardi (ed.) Selected Reflections in Language, Logic, and Information - ESSLLI 2019, ESSLLI 2020 and ESSLLI 2021 Student Sessions, Selected Papers","slides":"https://astahfrom.github.io/forest/bafkrmieb6vnan2xuf6jgt4a5ahe7g2dbu557z6ozqvtxbnplicgrkhacvm.pdf","bibtex":"@inproceedings{From21-ESSLLI,\nabstract = {I formalize a Henkin-style completeness proof for an axiomatic system for propositional logic in the proof assistant Isabelle/HOL. The formalization precisely details the structure of this proof method.},\nauthor = {Asta Halkj{æ}r From},\nbooktitle = {Selected Reflections in Language, Logic, and Information - {ESSLLI} 2019, {ESSLLI} 2020 and {ESSLLI} 2021 Student Sessions, Selected Papers},\ndoi = {10.1007/978-3-031-50628-4_5},\neditor = {Alexandra Pavlova and Mina Young Pedersen and Raffaella Bernardi},\npages = {80--92},\npublisher = {Springer},\nseries = {Lecture Notes in Computer Science},\ntitle = {Formalizing Henkin-Style Completeness of an Axiomatic System for Propositional Logic},\nvolume = {14354},\nyear = {2021},\n}"}},{"title":"On the Use of Isabelle/HOL for Formalizing New Concise Axiomatic Systems for Classical Propositional Logic","uri":"ahfrom-jvilladsen-2021-types","taxon":"Reference","tags":["abstract"],"route":"/forest/ahfrom-jvilladsen-2021-types/","metas":{"external":"https://types21.liacs.nl/download/on-the-use-of-isabelle-hol-for-formalizing-new-concise-axiomatic-systems-for-classical-propositional-logic/","venue":"27th International Conference on Types for Proofs and Programs (TYPES 2021)","bibtex":"@unpublished{FromV21-TYPES,\nabstract = {We describe novel axiomatic systems for classical propositional logic: one based on the K and S combinators and elimination rules and one on transitivity of implication, explosion and rules for disjunction. We show how Isabelle/HOL helps investigate such systems.},\nauthor = {Asta Halkjær From and Jørgen Villadsen},\nnote = {27th International Conference on Types for Proofs and Programs (TYPES 2021), accepted abstract},\ntitle = {On the Use of Isabelle/HOL for Formalizing New Concise Axiomatic Systems for Classical Propositional Logic},\nurl = {https://types21.liacs.nl/download/on-the-use-of-isabelle-hol-for-formalizing-new-concise-axiomatic-systems-for-classical-propositional-logic/},\nyear = {2021},\n}"}},{"title":"Public Announcement Logic","uri":"ahfrom-2021-afp-pal","taxon":"Reference","tags":["isabelle"],"route":"/forest/ahfrom-2021-afp-pal/","metas":{"external":"https://isa-afp.org/entries/Public_Announcement_Logic.html","venue":"Archive of Formal Proofs","bibtex":"@article{Public_Announcement_Logic-AFP,\nabstract = {This work is a formalization of public announcement logic with countably many agents. It includes proofs of soundness and completeness for a variant of the axiom system PA + DIST! + NEC!. The completeness proof builds on the Epistemic Logic theory. Paper: doi.org/10.1007/978-3-030-90138-7\\_2.},\nauthor = {Asta Halkjær From},\nissn = {2150-914x},\njournal = {Archive of Formal Proofs},\nmonth = {June},\ntitle = {Public Announcement Logic},\nurl = {https://isa-afp.org/entries/Public_Announcement_Logic.html},\nyear = {2021},\n}"}},{"title":"SeCaV: A Sequent Calculus Verifier in Isabelle/HOL","uri":"ahfrom-fkjacobsen-jvilladsen-2021-lsfa","taxon":"Reference","tags":["proceedings"],"route":"/forest/ahfrom-fkjacobsen-jvilladsen-2021-lsfa/","metas":{"doi":"10.4204/EPTCS.357.4","venue":"In M. Ayala-Rincón and E. Bonelli (ed.) Proceedings 16th Logical and Semantic Frameworks with Applications (LSFA 2021)","bibtex":"@inproceedings{FromJV21,\nabstract = {We describe SeCaV, a sequent calculus verifier for first-order logic in Isabelle/HOL, and the SeCaV Unshortener, an online tool that expands succinct derivations into the full SeCaV syntax. We leverage the power of Isabelle/HOL as a proof checker for our SeCaV derivations. The interactive features of Isabelle/HOL make our system transparent. For instance, the user can simply click on a side condition to see its exact definition. Our formalized soundness and completeness proofs pertain exactly to the calculus as exposed to the user and not just to some model of our tool. Users can also write their derivations in the SeCaV Unshortener, which provides a lighter syntax, and expand them for later verification. We have used both tools in our teaching.},\nauthor = {Asta Halkj{æ}r From and Frederik Krogsdal Jacobsen and J{ø}rgen Villadsen},\nbooktitle = {Proceedings 16th Logical and Semantic Frameworks with Applications, {LSFA} 2021, Buenos Aires, Argentina (Online), 23rd - 24th July, 2021},\ndoi = {10.4204/EPTCS.357.4},\neditor = {Mauricio Ayala{-}Rinc{ó}n and Eduardo Bonelli},\npages = {38--55},\npublisher = {Open Publishing Association},\nseries = {{EPTCS}},\ntitle = {{SeCaV}: {A} Sequent Calculus Verifier in {Isabelle/HOL}},\nvolume = {357},\nyear = {2021},\n}"}},{"title":"Soundness and Completeness of an Axiomatic System for First-Order Logic","uri":"ahfrom-2021-afp-axiomatic-fol","taxon":"Reference","tags":["isabelle"],"route":"/forest/ahfrom-2021-afp-axiomatic-fol/","metas":{"external":"https://isa-afp.org/entries/FOL_Axiomatic.html","venue":"Archive of Formal Proofs","bibtex":"@article{FOL_Axiomatic-AFP,\nabstract = {This work is a formalization of the soundness and completeness of an axiomatic system for first-order logic. The proof system is based on System Q1 by Smullyan and the completeness proof follows his textbook \"First-Order Logic\" (Springer-Verlag 1968). The completeness proof is in the Henkin style where a consistent set is extended to a maximal consistent set using Lindenbaum's construction and Henkin witnesses are added during the construction to ensure saturation as well. The resulting set is a Hintikka set which, by the model existence theorem, is satisfiable in the Herbrand universe. Paper: doi.org/10.4230/LIPIcs.TYPES.2021.8.},\nauthor = {Asta Halkjær From},\nissn = {2150-914x},\njournal = {Archive of Formal Proofs},\nmonth = {September},\ntitle = {Soundness and Completeness of an Axiomatic System for First-Order Logic},\nurl = {https://isa-afp.org/entries/FOL_Axiomatic.html},\nyear = {2021},\n}"}},{"title":"Teaching Automated Reasoning and Formally Verified Functional Programming in Agda and Isabelle/HOL","uri":"ahfrom-jvilladsen-2021-tfpie","taxon":"Reference","tags":["workshop"],"route":"/forest/ahfrom-jvilladsen-2021-tfpie/","metas":{"external":"https://wiki.tfpie.science.ru.nl/images/a/a6/TFPIE_AHF_JV.pdf","venue":"10th International Workshop on Trends in Functional Programming in Education (TFPIE 2021)","bibtex":"@unpublished{FromV21-TFPIE,\nabstract = {We formalize two micro provers for propositional logic in Isabelle/HOL and Agda. The provers are used in an automated reasoning course at DTU where they concretize discussions of soundness and completeness. The students are familiar with functional programming beforehand but formalizing the provers, and other programs, introduces the students to formally verified functional programming in a proof assistant. Proofs that have been informal in previous courses, for instance of termination, can now be verified by the machine, and the provers provide practical examples. Similarly, the formal meta-languages provided by the formalizations clarify boundaries that can be muddled with pen and paper, for instance between syntactic and semantic arguments. We find that the automation available in Isabelle/HOL provides succinctness while the verification in Agda closer resembles functional programming.},\nauthor = {From, Asta Halkj{æ}r and Villadsen, J{ø}rgen},\nnote = {10th International Workshop on Trends in Functional Programming in Education (TFPIE 2021) --- Presentation Only/Online Papers},\ntitle = {Teaching Automated Reasoning and Formally Verified Functional Programming in {Agda} and {Isabelle/HOL}},\nurl = {https://wiki.tfpie.science.ru.nl/images/a/a6/TFPIE_AHF_JV.pdf},\nyear = {2021},\n}"}},{"title":"Teaching Intuitionistic and Classical Propositional Logic Using Isabelle","uri":"jvilladsen-ahfrom-pblackburn-2021-thedu","taxon":"Reference","tags":["proceedings"],"route":"/forest/jvilladsen-ahfrom-pblackburn-2021-thedu/","metas":{"doi":"10.4204/EPTCS.354.6","venue":"In J. Marcos, W. Neuper and P. Quaresma (ed.) Proceedings 10th International Workshop on Theorem Proving Components for Educational Software (ThEdu@CADE 2021)","bibtex":"@inproceedings{VilladsenFB21,\nabstract = {We describe a natural deduction formalization of intuitionistic and classical propositional logic in the Isabelle/Pure framework. In contrast to earlier work, where we explored the pedagogical benefits of using a deep embedding approach to logical modelling, here we employ a logical framework modelling. This gives rise to simple and natural teaching examples and we report on the role it played in teaching our Automated Reasoning course in 2020 and 2021.},\nauthor = {J{ø}rgen Villadsen and Asta Halkj{æ}r From and Patrick Blackburn},\nbooktitle = {Proceedings 10th International Workshop on Theorem Proving Components for Educational Software, ThEdu@CADE 2021, (Remote) Carnegie Mellon University, Pittsburgh, PA, United States, 11 July 2021},\ndoi = {10.4204/EPTCS.354.6},\neditor = {Jo{ã}o Marcos and Walther Neuper and Pedro Quaresma},\npages = {71--85},\npublisher = {Open Publishing Association},\nseries = {{EPTCS}},\ntitle = {Teaching Intuitionistic and Classical Propositional Logic Using {Isabelle}},\nvolume = {354},\nyear = {2021},\n}"}},{"title":"Belief Revision and Isabelle/HOL","uri":"ahfrom-2020-talk-belief-revision","taxon":"Reference","tags":["talk"],"route":"/forest/ahfrom-2020-talk-belief-revision/","metas":{"venue":"Seminar course on belief revision at DTU Compute","slides":"https://astahfrom.github.io/forest/bafkrmibawehd65itfdzm2owllfouwwmzfsb7j52dhonxpgdgvtbwqvy7ke.pdf"}},{"title":"Formally Correct Deduction\nMethods for Computational Logic","uri":"ahfrom-2020-talk-cicm","taxon":"Reference","tags":["talk"],"route":"/forest/ahfrom-2020-talk-cicm/","metas":{"venue":"13th Conference on Intelligent Computer Mathematics (CICM 2020) doctoral session","slides":"https://astahfrom.github.io/forest/bafkrmibdgbezbheebux5gkklfzqgkndpwdnprztb7caswvw56b7xo4z2oq.pdf"}},{"title":"Hybrid Logic","uri":"ahfrom-2020-msc-thesis","taxon":"Reference","tags":["thesis"],"route":"/forest/ahfrom-2020-msc-thesis/","metas":{"venue":"MSc thesis, Technical University of Denmark","slides":"https://astahfrom.github.io/forest/bafkrmif2f42yxasrnngbmbxcgqfrc2x54v224pncgi363c4gdamulg6vpa.pdf","external":"https://astahfrom.github.io/forest/bafkrmibgefm3nzpxevhkgcdeyjvm4bieoayke44eshkhujkcz3d4vftdya.pdf"}},{"title":"A Concise Sequent Calculus for Teaching First-Order Logic","uri":"ahfrom-jvilladsen-2020-isabelle-workshop","taxon":"Reference","tags":["workshop"],"route":"/forest/ahfrom-jvilladsen-2020-isabelle-workshop/","metas":{"external":"https://files.sketis.net/Isabelle_Workshop_2020/Isabelle_2020_paper_6.pdf","venue":"Isabelle Workshop 2020","slides":"https://astahfrom.github.io/forest/bafkrmihtqy63lees3qkjij5iqz6qj7e6ctvteevbpecrijgqln5z7gl5hq.pdf","bibtex":"@unpublished{FromV20,\nabstract = {We have formalized soundness and completeness for a sequent calculus for classical first- order logic in the proof assistant Isabelle/HOL. We first describe a technique for extending a completeness result for closed formulas to completeness for open formulas as well. This requires some tricky reasoning due to our use of de Bruijn indices. We then describe a concise sequent calculus for first-order logic and introduce a useful way to write up the sequent calculus derivations in Isabelle/HOL. Our formalization has recently been used in a computer science course on automated reasoning.},\nauthor = {Asta Halkjær From and Jørgen Villadsen},\nnote = {Isabelle Workshop 2020},\ntitle = {A Concise Sequent Calculus for Teaching First-Order Logic},\nurl = {https://files.sketis.net/Isabelle_Workshop_2020/Isabelle_2020_paper_6.pdf},\nyear = {2020},\n}"}},{"title":"Formalizing a Seligman-Style Tableau System for Hybrid Logic (Short Paper)","uri":"ahfrom-pblackburn-jvilladsen-2020-ijcar","taxon":"Reference","tags":["proceedings"],"route":"/forest/ahfrom-pblackburn-jvilladsen-2020-ijcar/","metas":{"doi":"10.1007/978-3-030-51074-9_27","venue":"In N. Peltier and V. Sofronie-Stokkermans (ed.) Automated Reasoning - 10th International Joint Conference (IJCAR 2020)","slides":"https://astahfrom.github.io/forest/bafkrmiayct4s3reqd4vth3ee52kzx3abq66ozo7vqnhlc2dyfle443goi4.pdf","bibtex":"@inproceedings{FromBV20,\nabstract = {Hybrid logic is modal logic enriched with names for worlds. We formalize soundness and completeness proofs for a Seligman-style tableau system for hybrid logic in the proof assistant Isabelle/HOL. The formalization shows how to lift certain rule restrictions, thereby simplifying the original un-formalized proof. Moreover, the completeness proof we formalize is synthetic which suggests we can extend this work to prove a wider range of results about hybrid logic.},\nauthor = {Asta Halkj{æ}r From and Patrick Blackburn and J{ø}rgen Villadsen},\nbooktitle = {Automated Reasoning - 10th International Joint Conference, {IJCAR} 2020, Paris, France, July 1-4, 2020, Proceedings, Part {I}},\ndoi = {10.1007/978-3-030-51074-9_27},\neditor = {Nicolas Peltier and Viorica Sofronie{-}Stokkermans},\npages = {474--481},\npublisher = {Springer},\nseries = {Lecture Notes in Computer Science},\ntitle = {Formalizing a {Seligman}-Style Tableau System for Hybrid Logic (Short Paper)},\nvolume = {12166},\nyear = {2020},\n}"}},{"title":"Hybrid logic in the Isabelle Proof Assistant: Benefits, Challenges and the Road Ahead","uri":"ahfrom-2020-aiml","taxon":"Reference","tags":["abstract"],"route":"/forest/ahfrom-2020-aiml/","metas":{"external":"https://archive.org/details/aiml2020shortpapers.pdf","venue":"In N. Olivetti and R. Verbrugge (ed.) Short Papers: Advances in Modal Logic (AiML 2020)","slides":"https://astahfrom.github.io/forest/bafkrmihd7mecge5c2dakppwfqirps6be77uz44qubwpg7kipjiekdjcqgq.pdf","bibtex":"@inproceedings{From20-AiML,\nabstract = {We outline benefits of formalizing a proof system for hybrid logic in the proof assistant Isabelle/HOL, showcase how the process of formalization can shape our proofs, and describe our current work on formalizing completeness of a more restrictive system. Formalization: https://devel.isa-afp.org/entries/Hybrid\\_Logic.html},\nauthor = {Asta Halkj{æ}r From},\nbooktitle = {Short Papers: Advances in Modal Logic (AiML 2020)},\neditor = {Nicola Olivetti and Rinke Verbrugge},\npages = {23--27},\ntitle = {Hybrid logic in the Isabelle Proof Assistant: Benefits, Challenges and the Road Ahead},\nurl = {https://archive.org/details/aiml2020shortpapers.pdf},\nyear = {2020},\n}"}},{"title":"Isabelle/HOL as a Meta-Language for Teaching Logic","uri":"ahfrom-jvilladsen-pblackburn-2020-thedu","taxon":"Reference","tags":["proceedings"],"route":"/forest/ahfrom-jvilladsen-pblackburn-2020-thedu/","metas":{"doi":"10.4204/EPTCS.328.2","venue":"In P. Quaresma, W. Neuper and J. Marcos (ed.) Proceedings 9th International Workshop on Theorem Proving Components for Educational Software (ThEdu@IJCAR 2020)","bibtex":"@inproceedings{FromVB20,\nabstract = {Proof assistants are important tools for teaching logic. We support this claim by discussing three formalizations in Isabelle/HOL used in a recent course on automated reasoning. The first is a formalization of System W (a system of classical propositional logic with only two primitive symbols), the second is the Natural Deduction Assistant (NaDeA), and the third is a one-sided sequent calculus that uses our Sequent Calculus Verifier (SeCaV). We describe each formalization in turn, concentrating on how we used them in our teaching, and commenting on features that are interesting or useful from a logic education perspective. In the conclusion, we reflect on the lessons learned and where they might lead us next.},\nauthor = {Asta Halkj{æ}r From and J{ø}rgen Villadsen and Patrick Blackburn},\nbooktitle = {Proceedings 9th International Workshop on Theorem Proving Components for Educational Software, ThEdu@IJCAR 2020, Paris, France, 29th June 2020},\ndoi = {10.4204/EPTCS.328.2},\neditor = {Pedro Quaresma and Walther Neuper and Jo{ã}o Marcos},\npages = {18--34},\npublisher = {Open Publishing Association},\nseries = {{EPTCS}},\ntitle = {{Isabelle/HOL} as a Meta-Language for Teaching Logic},\nvolume = {328},\nyear = {2020},\n}"}},{"title":"Synthetic Completeness for a Terminating Seligman-Style Tableau System","uri":"ahfrom-2020-types","taxon":"Reference","tags":["proceedings"],"route":"/forest/ahfrom-2020-types/","metas":{"doi":"10.4230/LIPIcs.TYPES.2020.5","venue":"In U. de'Liguoro, S. Berardi and T. Altenkirch (ed.) 26th International Conference on Types for Proofs and Programs (TYPES 2020)","bibtex":"@inproceedings{From20-TYPES,\nabstract = {Hybrid logic extends modal logic with nominals that name worlds. Seligman-style tableau systems for hybrid logic divide branches into blocks named by nominals to achieve a local proof style. We present a Seligman-style tableau system with a formalization in the proof assistant Isabelle/HOL. Our system refines an existing system to simplify formalization and we claim termination from this relationship. Existing completeness proofs that account for termination are either analytic or based on translation, but synthetic proofs have been shown to generalize to richer logics and languages. Our main result is the first synthetic completeness proof for a terminating hybrid logic tableau system. It is also the first formalized completeness proof for any hybrid logic proof system.},\nauthor = {Asta Halkj{æ}r From},\nbooktitle = {26th International Conference on Types for Proofs and Programs, {TYPES} 2020, March 2-5, 2020, University of Turin, Italy},\ndoi = {10.4230/LIPIcs.TYPES.2020.5},\neditor = {Ugo de'Liguoro and Stefano Berardi and Thorsten Altenkirch},\npages = {5:1--5:17},\npublisher = {Schloss Dagstuhl - Leibniz-Zentrum f{ü}r Informatik},\nseries = {LIPIcs},\ntitle = {Synthetic Completeness for a Terminating {Seligman}-Style Tableau System},\nvolume = {188},\nyear = {2020},\n}"}},{"title":"Using the Isabelle Proof Assistant: Seligman-Style Tableau for Hybrid Logic","uri":"ahfrom-2019-talk-prior","taxon":"Reference","tags":["talk"],"route":"/forest/ahfrom-2019-talk-prior/","metas":{"venue":"The LogicS of Prior: Past, Present, and Future, Roskilde University","slides":"https://astahfrom.github.io/forest/bafkrmicvxtj2njtxd4zvg7acfgdezs2boyvfm2l7zodcpkb4vundwhwysm.pdf"}},{"title":"A Sequent Calculus for First-Order Logic","uri":"ahfrom-2019-afp-seqcalc-fol","taxon":"Reference","tags":["isabelle"],"route":"/forest/ahfrom-2019-afp-seqcalc-fol/","metas":{"external":"https://isa-afp.org/entries/FOL_Seq_Calc1.html","venue":"Archive of Formal Proofs","bibtex":"@article{FOL_Seq_Calc1-AFP,\nabstract = {This work formalizes soundness and completeness of a one-sided sequent calculus for first-order logic. The completeness is shown via a translation from a complete semantic tableau calculus, the proof of which is based on the First-Order Logic According to Fitting theory. The calculi and proof techniques are taken from Ben-Ari's Mathematical Logic for Computer Science. Paper: ceur-ws.org/Vol-3002/paper7.pdf.},\nauthor = {Asta Halkjær From},\nissn = {2150-914x},\njournal = {Archive of Formal Proofs},\nmonth = {July},\ntitle = {A Sequent Calculus for First-Order Logic},\nurl = {https://isa-afp.org/entries/FOL_Seq_Calc1.html},\nyear = {2019},\n}"}},{"title":"Formalizing a Seligman-Style Tableau System for Hybrid Logic","uri":"ahfrom-2019-afp-hybrid","taxon":"Reference","tags":["isabelle"],"route":"/forest/ahfrom-2019-afp-hybrid/","metas":{"external":"https://isa-afp.org/entries/Hybrid_Logic.html","venue":"Archive of Formal Proofs","bibtex":"@article{Hybrid_Logic-AFP,\nabstract = {This work is a formalization of soundness and completeness proofs for a Seligman-style tableau system for hybrid logic. The completeness result is obtained via a synthetic approach using maximally consistent sets of tableau blocks. The formalization differs from previous work in a few ways. First, to avoid the need to backtrack in the construction of a tableau, the formalized system has no unnamed initial segment, and therefore no Name rule. Second, I show that the full Bridge rule is admissible in the system. Third, I start from rules restricted to only extend the branch with new formulas, including only witnessing diamonds that are not already witnessed, and show that the unrestricted rules are admissible. Similarly, I start from simpler versions of the @-rules and show that these are sufficient. The GoTo rule is restricted using a notion of potential such that each application consumes potential and potential is earned through applications of the remaining rules. I show that if a branch can be closed then it can be closed starting from a single unit. Finally, Nom is restricted by a fixed set of allowed nominals. The resulting system should be terminating. Paper: doi.org/10.4230/LIPIcs.TYPES.2020.5.},\nauthor = {Asta Halkjær From},\nissn = {2150-914x},\njournal = {Archive of Formal Proofs},\nmonth = {December},\ntitle = {Formalizing a Seligman-Style Tableau System for Hybrid Logic},\nurl = {https://isa-afp.org/entries/Hybrid_Logic.html},\nyear = {2019},\n}"}},{"title":"Teaching a Formalized Logical Calculus","uri":"ahfrom-abjensen-aschlichtkrull-jvilladsen-2019-thedu","taxon":"Reference","tags":["proceedings"],"route":"/forest/ahfrom-abjensen-aschlichtkrull-jvilladsen-2019-thedu/","metas":{"doi":"10.4204/EPTCS.313.5","venue":"In P. Quaresma, W. Neuper and J. Marcos (ed.) Proceedings 8th International Workshop on Theorem Proving Components for Educational Software (ThEdu@CADE 2019)","bibtex":"@inproceedings{FromJSV19,\nabstract = {Classical first-order logic is in many ways central to work in mathematics, linguistics, computer science and artificial intelligence, so it is worthwhile to define it in full detail. We present soundness and completeness proofs of a sequent calculus for first-order logic, formalized in the interactive proof assistant Isabelle/HOL. Our formalization is based on work by Stefan Berghofer, which we have since updated to use Isabelle's declarative proof style Isar (Archive of Formal Proofs, Entry FOL-Fitting, August 2007 / July 2018). We represent variables with de Bruijn indices; this makes substitution under quantifiers less intuitive for a human reader. However, the nature of natural numbers yields an elegant solution when compared to implementations of substitution using variables represented by strings. The sequent calculus considered has the special property of an always empty antecedent and a list of formulas in the succedent. We obtain the proofs of soundness and completeness for the sequent calculus as a derived result of the inverse duality of its tableau counterpart. We strive to not only present the results of the proofs of soundness and completeness, but also to provide a deep dive into a programming-like approach to the formalization of first-order logic syntax, semantics and the sequent calculus. We use the formalization in a bachelor course on logic for computer science and discuss our experiences.},\nauthor = {Asta Halkj{æ}r From and Alexander Birch Jensen and Anders Schlichtkrull and J{ø}rgen Villadsen},\nbooktitle = {Proceedings 8th International Workshop on Theorem Proving Components for Educational Software, ThEdu@CADE 2019, Natal, Brazil, 25th August 2019},\ndoi = {10.4204/EPTCS.313.5},\neditor = {Pedro Quaresma and Walther Neuper and Jo{ã}o Marcos},\npages = {73--92},\npublisher = {Open Publishing Association},\nseries = {{EPTCS}},\ntitle = {Teaching a Formalized Logical Calculus},\nvolume = {313},\nyear = {2019},\n}"}},{"title":"Magnolia: Implementing System F with Anonymous Sums and Products","uri":"ahfrom-2018-talk-magnolia","taxon":"Reference","tags":["talk"],"route":"/forest/ahfrom-2018-talk-magnolia/","metas":{"venue":"Workshop on Programs & Proofs, DTU Compute","slides":"https://astahfrom.github.io/forest/bafkrmicrj3hz2lqxewdjt2gkjkszssqessmbd4q5hwslrr7mpt53f5ygdu.pdf"}},{"title":"A Verified Simple Prover for First-Order Logic","uri":"jvilladsen-aschlichtkrull-ahfrom-2018-paar","taxon":"Reference","tags":["proceedings"],"route":"/forest/jvilladsen-aschlichtkrull-ahfrom-2018-paar/","metas":{"external":"http://ceur-ws.org/Vol-2162/paper-08.pdf","venue":"In B. Konev, J. Urban and P. Rümmer (ed.) Proceedings of the 6th Workshop on Practical Aspects of Automated Reasoning (PAAR 2018)","bibtex":"@inproceedings{VilladsenSF18,\nabstract = {We present a simple prover for first-order logic with certified soundness and completeness in Isabelle/HOL, taking formalizations by Tom Ridge and others as the starting point, but with the aim of using the approach for teaching logic and verification to computer science stu- dents at the bachelor level. The prover is simple in the following sense: It is purely functional and can be executed with rewriting rules or as code generation to a number of functional programming languages. The prover uses no higher-order functions, that is, no function takes a function as argument or returns a function as its result. This is advantageous when students perform rewriting steps by hand. The prover uses the logic of first-order logic on negation normal form with a term language consist- ing of only variables. This subset of the full syntax of first-order logic allows for a simple proof system without resorting to the much weaker propositional logic.},\nauthor = {J{ø}rgen Villadsen and Anders Schlichtkrull and Asta Halkj{æ}r From},\nbooktitle = {Proceedings of the 6th Workshop on Practical Aspects of Automated Reasoning co-located with Federated Logic Conference 2018 (FLoC 2018), Oxford, UK, July 19th, 2018},\neditor = {Boris Konev and Josef Urban and Philipp R{ü}mmer},\npages = {88--104},\npublisher = {CEUR-WS.org},\nseries = {{CEUR} Workshop Proceedings},\ntitle = {A Verified Simple Prover for First-Order Logic},\nurl = {http://ceur-ws.org/Vol-2162/paper-08.pdf},\nvolume = {2162},\nyear = {2018},\n}"}},{"title":"Drawing Trees","uri":"ahfrom-aschlichtkrull-jvilladsen-2018-isabelle-workshop","taxon":"Reference","tags":["workshop"],"route":"/forest/ahfrom-aschlichtkrull-jvilladsen-2018-isabelle-workshop/","metas":{"external":"https://files.sketis.net/Isabelle_Workshop_2018/Isabelle_2018_paper_7.pdf","venue":"Isabelle Workshop 2018","bibtex":"@unpublished{FromSV18,\nabstract = {We formally prove in Isabelle/HOL two properties of an algorithm for laying out trees visually. The first property states that removing layout annotations recovers the original tree. The second property states that nodes are placed at least a unit of distance apart. We have yet to formalize three additional properties: That parents are centered above their children, that drawings are symmetrical with respect to reflection and that identical subtrees are rendered identically.},\nauthor = {Asta Halkjær From and Anders Schlichtkrull and Jørgen Villadsen},\nnote = {Isabelle Workshop 2018},\ntitle = {Drawing Trees},\nurl = {https://files.sketis.net/Isabelle_Workshop_2018/Isabelle_2018_paper_7.pdf},\nyear = {2018},\n}"}},{"title":"Epistemic Logic: Completeness of Modal Logics","uri":"ahfrom-2018-afp-epistemic","taxon":"Reference","tags":["isabelle"],"route":"/forest/ahfrom-2018-afp-epistemic/","metas":{"external":"https://isa-afp.org/entries/Epistemic_Logic.html","venue":"Archive of Formal Proofs","bibtex":"@article{Epistemic_Logic-AFP,\nabstract = {This work is a formalization of epistemic logic. It includes proofs of soundness and completeness for the axiom system K. The completeness proof is based on the textbook \"Reasoning About Knowledge\" by Fagin, Halpern, Moses and Vardi (MIT Press 1995). The extensions of system K (T, KB, K4, S4, S5) and their completeness proofs are based on the textbook \"Modal Logic\" by Blackburn, de Rijke and Venema (Cambridge University Press 2001). Papers: doi.org/10.1007/978-3-030-88853-4\\_1, doi.org/10.1007/978-3-030-90138-7\\_2.},\nauthor = {Asta Halkjær From},\nissn = {2150-914x},\njournal = {Archive of Formal Proofs},\nmonth = {October},\ntitle = {Epistemic Logic: Completeness of Modal Logics},\nurl = {https://isa-afp.org/entries/Epistemic_Logic.html},\nyear = {2018},\n}"}},{"title":"Formalized Soundness and Completeness of Natural Deduction for First-Order Logic","uri":"ahfrom-2018-sls","taxon":"Reference","tags":["abstract"],"route":"/forest/ahfrom-2018-sls/","metas":{"external":"https://scandinavianlogic.org/assets/attachments/book_of_abstracts_sls2018.pdfpage=11","venue":"Scandinavian Logic Symposium (SLS 2018)","slides":"https://astahfrom.github.io/forest/bafkrmic6m3tyxdmsr7qam3ccukbntbby3l4x672mzwajslprra7fvvz55m.pdf","bibtex":"@unpublished{From18,\nauthor = {Asta Halkjær From},\nnote = {Scandinavian Logic Symposium (SLS 2018), accepted abstract},\ntitle = {Formalized Soundness and Completeness of Natural Deduction for First-Order Logic},\nurl = {https://scandinavianlogic.org/assets/attachments/book_of_abstracts_sls2018.pdf#page=11},\nyear = {2018},\n}"}},{"title":"Multi-Agent Programming Contest 2016 --- The Python-DTU Team","uri":"jvilladsen-ahfrom-sjacobi-nnlarsen-2018-mapc","taxon":"Reference","tags":["journal"],"route":"/forest/jvilladsen-ahfrom-sjacobi-nnlarsen-2018-mapc/","metas":{"doi":"10.1504/IJAOSE.2018.10010604","venue":"International Journal of Agent-Oriented Software Engineering 6(1)","bibtex":"@article{VilladsenFJL18,\nabstract = {We provide a detailed description of the Python-DTU system, including the overall system design and the tools used in the agent contest.},\nauthor = {J{ø}rgen Villadsen and Asta Halkj{æ}r From and Salvador Jacobi and Nikolaj N{ø}kkentved Larsen},\ndoi = {10.1504/IJAOSE.2018.10010604},\njournal = {International Journal of Agent-Oriented Software Engineering},\nnumber = {1},\npages = {86--100},\ntitle = {Multi-Agent Programming Contest 2016 --- The {Python-DTU} Team},\nvolume = {6},\nyear = {2018},\n}"}},{"title":"Multi-Agent Programming Contest 2018 — The Jason-DTU Team","uri":"jvilladsen-mobjoern-ahfrom-tshenney-jblarsen-2018-mapc","taxon":"Reference","tags":["proceedings"],"route":"/forest/jvilladsen-mobjoern-ahfrom-tshenney-jblarsen-2018-mapc/","metas":{"doi":"10.1007/978-3-030-37959-9_3","venue":"In T. Ahlbrecht, J. Dix and N. Fiekas (ed.) The Multi-Agent Programming Contest 2018 — Agents Teaming Up in an Urban Environment","bibtex":"@incollection{VilladsenBFHL18,\nabstract = {We provide a brief description of the Jason-DTU system, including the overall system design and the tools that we used in the Multi-Agent Programming Contest. We also provide a detailed evaluation of our system. The strengths of our system include dynamic assignment of agents to groups, enabling flexible use of agents according to the current situation. Our team performed overall very well and we won some matches by either a fairly big margin or closely.},\nauthor = {J{ø}rgen Villadsen and Mads Okholm Bj{ø}rn and Asta Halkj{æ}r From and Thomas S{ø}ren Henney and John Bruntse Larsen},\nbooktitle = {The Multi-Agent Programming Contest 2018 --- Agents Teaming Up in an Urban Environment},\ndoi = {10.1007/978-3-030-37959-9_3},\neditor = {Tobias Ahlbrecht and J{ü}rgen Dix and Niklas Fiekas},\npages = {41--71},\npublisher = {Springer},\nseries = {Lecture Notes in Computer Science},\ntitle = {Multi-Agent Programming Contest 2018 --- The {Jason-DTU} Team},\nvolume = {11957},\nyear = {2018},\n}"}},{"title":"Natural Deduction Assistant (NaDeA)","uri":"jvilladsen-ahfrom-aschlichtkrull-2018-thedu","taxon":"Reference","tags":["proceedings"],"route":"/forest/jvilladsen-ahfrom-aschlichtkrull-2018-thedu/","metas":{"doi":"10.4204/EPTCS.290.2","venue":"In P. Quaresma and W. Neuper (ed.) Proceedings 7th International Workshop on Theorem proving components for Educational software (ThEdu@FLoC 2018)","bibtex":"@inproceedings{VilladsenFS18,\nabstract = {We present the Natural Deduction Assistant (NaDeA) and discuss its advantages and disadvantages as a tool for teaching logic. NaDeA is available online and is based on a formalization of natural deduction in the Isabelle proof assistant. We first provide concise formulations of the main formalization results. We then elaborate on the prerequisites for NaDeA, in particular we describe a formalization in Isabelle of \"Hilbert's Axioms\" that we use as a starting point in our bachelor course on mathematical logic. We discuss a recent evaluation of NaDeA and also give an overview of the exercises in NaDeA.},\nauthor = {J{ø}rgen Villadsen and Asta Halkj{æ}r From and Anders Schlichtkrull},\nbooktitle = {Proceedings 7th International Workshop on Theorem proving components for Educational software, ThEdu@FLoC 2018, Oxford, United Kingdom, 18 july 2018},\ndoi = {10.4204/EPTCS.290.2},\neditor = {Pedro Quaresma and Walther Neuper},\npages = {14--29},\npublisher = {Open Publishing Association},\nseries = {{EPTCS}},\ntitle = {{Natural Deduction Assistant (NaDeA)}},\nvolume = {290},\nyear = {2018},\n}"}},{"title":"Students' Proof Assistant (SPA)","uri":"aschlichtkrull-jvilladsen-ahfrom-2018-thedu","taxon":"Reference","tags":["proceedings"],"route":"/forest/aschlichtkrull-jvilladsen-ahfrom-2018-thedu/","metas":{"doi":"10.4204/EPTCS.290.1","venue":"In P. Quaresma and W. Neuper (ed.) Proceedings 7th International Workshop on Theorem proving components for Educational software (ThEdu@FLoC 2018)","bibtex":"@inproceedings{SchlichtkrullVF18,\nabstract = {The Students' Proof Assistant (SPA) aims to both teach how to use a proof assistant like Isabelle and also to teach how reliable proof assistants are built. Technically it is a miniature proof assistant inside the Isabelle proof assistant. In addition we conjecture that a good way to teach structured proving is with a concrete prover where the connection between semantics, proof system, and prover is clear. The proofs in Lamport's TLAPS proof assistant have a very similar structure to those in the declarative prover SPA. To illustrate this we compare a proof of Pelletier's problem 43 in TLAPS, Isabelle/Isar and SPA. We also consider Pelletier's problem 34, also known as Andrews's Challenge, where students are encouraged to develop their own justification function and thus obtain a lot of insight into the proof assistant. Although SPA is fully functional we have so far only used it in a few educational scenarios.},\nauthor = {Anders Schlichtkrull and J{ø}rgen Villadsen and Asta Halkj{æ}r From},\nbooktitle = {Proceedings 7th International Workshop on Theorem proving components for Educational software, ThEdu@FLoC 2018, Oxford, United Kingdom, 18 july 2018},\ndoi = {10.4204/EPTCS.290.1},\neditor = {Pedro Quaresma and Walther Neuper},\npages = {1--13},\npublisher = {Open Publishing Association},\nseries = {{EPTCS}},\ntitle = {Students' Proof Assistant {(SPA)}},\nvolume = {290},\nyear = {2018},\n}"}},{"title":"Substitutionless First-Order Logic: A Formal Soundness Proof","uri":"ahfrom-jblarsen-aschlichtkrull-jvilladsen-2018-isabelle-workshop","taxon":"Reference","tags":["workshop"],"route":"/forest/ahfrom-jblarsen-aschlichtkrull-jvilladsen-2018-isabelle-workshop/","metas":{"external":"https://files.sketis.net/Isabelle_Workshop_2018/Isabelle_2018_paper_3.pdf","venue":"Isabelle Workshop 2018","bibtex":"@unpublished{FromLSV18,\nabstract = {Substitution under quantifiers is non-trivial and may obscure a proof system for newcomers. Monk (Arch. Math. Log. Grundl. 1965) successfully eliminates substitution via identities and also uses a so-called normalization of formulas as a further simplification. We formalize the substitutionless proof system in Isabelle/HOL, spelling out its side conditions explicitly and verifying its soundness.},\nauthor = {Asta Halkjær From and John Bruntse Larsen and Anders Schlichtkrull and Jørgen Villadsen},\nnote = {Isabelle Workshop 2018.},\ntitle = {Substitutionless First-Order Logic: A Formal Soundness Proof},\nurl = {https://files.sketis.net/Isabelle_Workshop_2018/Isabelle_2018_paper_3.pdf},\nyear = {2018},\n}"}},{"title":"Teaching First-Order Logic with the Natural Deduction Assistant (NaDeA)","uri":"ahfrom-hhatteland-jvilladsen-2018-sls","taxon":"Reference","tags":["abstract"],"route":"/forest/ahfrom-hhatteland-jvilladsen-2018-sls/","metas":{"external":"https://scandinavianlogic.org/assets/attachments/book_of_abstracts_sls2018.pdfpage=11","venue":"Scandinavian Logic Symposium (SLS 2018)","bibtex":"@unpublished{FromHV18,\nauthor = {Asta Halkjær From and Helge Hatteland and Jørgen Villadsen},\nnote = {Scandinavian Logic Symposium (SLS 2018), accepted abstract},\ntitle = {Teaching First-Order Logic with the Natural Deduction Assistant ({NaDeA})},\nurl = {https://scandinavianlogic.org/assets/attachments/book_of_abstracts_sls2018.pdf#page=11},\nyear = {2018},\n}"}},{"title":"FIT: From's Isabelle Tutorial: Verification of Quicksort","uri":"ahfrom-2017-talk-fit","taxon":"Reference","tags":["talk"],"route":"/forest/ahfrom-2017-talk-fit/","metas":{"venue":"Proof Assistants and Related Tools (PART), DTU Compute","slides":"https://astahfrom.github.io/forest/bafkrmidsxiws4hsnsxe2afgjfilfjb45zjna3r4fynpqlaum3wok64zmmq.pdf"}},{"title":"Formalized First-Order Logic","uri":"ahfrom-2017-bsc-thesis","taxon":"Reference","tags":["thesis"],"route":"/forest/ahfrom-2017-bsc-thesis/","metas":{"venue":"BSc thesis, Technical University of Denmark","slides":"https://astahfrom.github.io/forest/bafkrmidyzxhgvx765ci7iir3gfu4oo2kpspkhseineoygmtdnkm5x5p44i.pdf","external":"https://astahfrom.github.io/forest/bafkrmigyesd2x7y7pjzqfzmh4ymip2qvjer5yi4qfmxflcnjc4pwwxnsfi.pdf"}},{"title":"Natural Deduction and the Isabelle Proof Assistant","uri":"jvilladsen-ahfrom-aschlichtkrull-2017-thedu","taxon":"Reference","tags":["proceedings"],"route":"/forest/jvilladsen-ahfrom-aschlichtkrull-2017-thedu/","metas":{"doi":"10.4204/EPTCS.267.9","venue":"In P. Quaresma and W. Neuper (ed.) Proceedings 6th International Workshop on Theorem proving components for Educational software (ThEdu@CADE 2017)","bibtex":"@inproceedings{VilladsenFS17,\nabstract = {We describe our Natural Deduction Assistant (NaDeA) and the interfaces between the Isabelle proof assistant and NaDeA. In particular, we explain how NaDeA, using a generated prover that has been verified in Isabelle, provides feedback to the student, and also how NaDeA, for each formula proved by the student, provides a generated theorem that can be verified in Isabelle.},\nauthor = {J{ø}rgen Villadsen and Asta Halkj{æ}r From and Anders Schlichtkrull},\nbooktitle = {Proceedings 6th International Workshop on Theorem proving components for Educational software, ThEdu@CADE 2017, Gothenburg, Sweden, 6 Aug 2017},\ndoi = {10.4204/EPTCS.267.9},\neditor = {Pedro Quaresma and Walther Neuper},\npages = {140--155},\npublisher = {Open Publishing Association},\nseries = {{EPTCS}},\ntitle = {Natural Deduction and the {Isabelle} Proof Assistant},\nvolume = {267},\nyear = {2017},\n}"}},{"title":"Code Generation for a Simple First-Order Prover","uri":"jvilladsen-aschlichtkrull-ahfrom-2016-isabelle-workshop","taxon":"Reference","tags":["workshop"],"route":"/forest/jvilladsen-aschlichtkrull-ahfrom-2016-isabelle-workshop/","metas":{"external":"https://web.archive.org/web/20220121022845/https://www21.in.tum.de/~nipkow/Isabelle2016/Isabelle2016_12.pdf","venue":"Isabelle Workshop 2016","bibtex":"@unpublished{VilladsenSF16,\nabstract = {We present Standard ML code generation in Isabelle/HOL of a sound and complete prover for first-order logic, taking formalizations by Tom Ridge and others as the starting point. We also define a set of so-called unfolding rules and show how to use these as a simple prover, with the aim of using the approach for teaching logic and verification to computer science students at the bachelor level.},\nauthor = {Jørgen Villadsen and Anders Schlichtkrull and Asta Halkjær From},\nnote = {Isabelle Workshop 2016},\ntitle = {Code Generation for a Simple First-Order Prover},\nurl = {https://web.archive.org/web/20220121022845/https://www21.in.tum.de/~nipkow/Isabelle2016/Isabelle2016_12.pdf},\nyear = {2016},\n}"}},{"title":"Agnes Moesgård Eschen","uri":"ameschen","taxon":"Person","tags":[],"route":"/forest/ameschen/","metas":{}},{"title":"Alexander Birch Jensen","uri":"abjensen","taxon":"Person","tags":[],"route":"/forest/abjensen/","metas":{"orcid":"0000-0002-7298-2133"}},{"title":"Anders Schlichtkrull","uri":"aschlichtkrull","taxon":"Person","tags":[],"route":"/forest/aschlichtkrull/","metas":{"external":"https://people.cs.aau.dk/~andsch/","institution":"Aalborg University Copenhagen","orcid":"0000-0001-9212-6150","position":"Associate Professor"}},{"title":"Archive of Formal Proofs","uri":"afp","taxon":"Journal","tags":[],"route":"/forest/afp/","metas":{"external":"https://www.isa-afp.org/"}},{"title":"Asta Halkjær From","uri":"ahfrom","taxon":"Person","tags":[],"route":"/forest/ahfrom/","metas":{"external":"https://astahfrom.github.io/","institution":"University of Copenhagen","orcid":"0000-0002-3601-0804","position":"Postdoc"}},{"title":"Bibliography","uri":"ahf-bib","taxon":null,"tags":[],"route":"/forest/ahf-bib/","metas":{}},{"title":"DTU Compute","uri":"dtucompute","taxon":"Department","tags":[],"route":"/forest/dtucompute/","metas":{"venue":"Technical University of Denmark"}},{"title":"Department of Computer Science","uri":"diku","taxon":"Department","tags":[],"route":"/forest/diku/","metas":{"venue":"University of Copenhagen"}},{"title":"Dmitriy Traytel","uri":"dtraytel","taxon":"Person","tags":[],"route":"/forest/dtraytel/","metas":{"external":"https://traytel.bitbucket.io/","institution":"University of Copenhagen","orcid":"0000-0001-7982-2768","position":"Associate Professor"}},{"title":"Entries in the Archive of Formal Proofs","uri":"ahf-afp","taxon":null,"tags":[],"route":"/forest/ahf-afp/","metas":{}},{"title":"Frederik Krogsdal Jacobsen","uri":"fkjacobsen","taxon":"Person","tags":[],"route":"/forest/fkjacobsen/","metas":{"external":"https://fkj.github.io/","orcid":"0000-0003-3651-8314"}},{"title":"Helge Hatteland","uri":"hhatteland","taxon":"Person","tags":[],"route":"/forest/hhatteland/","metas":{}},{"title":"Jannis Limperg","uri":"jlimperg","taxon":"Person","tags":[],"route":"/forest/jlimperg/","metas":{"external":"https://limperg.de/","institution":"LMU München","orcid":"0000-0002-8861-5231","position":"PhD student"}},{"title":"John Bruntse Larsen","uri":"jblarsen","taxon":"Person","tags":[],"route":"/forest/jblarsen/","metas":{"orcid":"0000-0003-2500-9944"}},{"title":"Julie Lundbak Kofod","uri":"jlkofod","taxon":"Person","tags":[],"route":"/forest/jlkofod/","metas":{}},{"title":"Jørgen Villadsen","uri":"jvilladsen","taxon":"Person","tags":[],"route":"/forest/jvilladsen/","metas":{"external":"https://people.compute.dtu.dk/jovi/","institution":"Technical University of Denmark","orcid":"0000-0003-3624-1159","position":"Associate Professor"}},{"title":"Mads Okholm Bjørn","uri":"mobjoern","taxon":"Person","tags":[],"route":"/forest/mobjoern/","metas":{}},{"title":"Nikolaj Nøkkentved Larsen","uri":"nnlarsen","taxon":"Person","tags":[],"route":"/forest/nnlarsen/","metas":{}},{"title":"Nina Gierasimczuk","uri":"ngierasimczuk","taxon":"Person","tags":[],"route":"/forest/ngierasimczuk/","metas":{"external":"https://ninagierasimczuk.com/","institution":"Technical University of Denmark","orcid":"0000-0001-5081-4676","position":"Associate Professor"}},{"title":"Patrick Blackburn","uri":"pblackburn","taxon":"Person","tags":[],"route":"/forest/pblackburn/","metas":{"external":"https://www.patrickblackburn.org/","institution":"Roskilde University","orcid":"0000-0001-9345-552X","position":"Professor"}},{"title":"Roskilde University","uri":"ruc","taxon":"Institution","tags":[],"route":"/forest/ruc/","metas":{}},{"title":"Salvador Jacobi","uri":"sjacobi","taxon":"Person","tags":[],"route":"/forest/sjacobi/","metas":{}},{"title":"Simon Tobias Lund","uri":"stlund","taxon":"Person","tags":[],"route":"/forest/stlund/","metas":{"institution":"Technical University of Denmark","orcid":"0009-0005-2957-3472","position":"PhD student"}},{"title":"Talks","uri":"ahf-talks","taxon":null,"tags":[],"route":"/forest/ahf-talks/","metas":{}},{"title":"Technical University of Denmark","uri":"dtu","taxon":"Institution","tags":[],"route":"/forest/dtu/","metas":{}},{"title":"Thomas Søren Henney","uri":"tshenney","taxon":"Person","tags":[],"route":"/forest/tshenney/","metas":{}},{"title":"Torben Braüner","uri":"tbrauner","taxon":"Person","tags":[],"route":"/forest/tbrauner/","metas":{"external":"https://forskning.ruc.dk/en/persons/torben","institution":"Roskilde University","orcid":"0000-0003-4582-1702","position":"Professor"}},{"title":"University of Copenhagen","uri":"ucph","taxon":"Institution","tags":[],"route":"/forest/ucph/","metas":{}},{"title":"astahfrom.github.io","uri":"index","taxon":null,"tags":[],"route":"/forest/index/","metas":{}}]